week = ['월', '화', '수', '목', '금', '토', '일']
print(week)
print(type(week))

#'수', '목, '금
print(week[2:4+1])          #슬라이싱
print(week)

#'월', '화', '수', '목', '금'
print(week[:5])         #0번째 인덱스 생략가능


print('---------------------')

#휴일(토~일) 슬라이싱하시오.
print(week[5:7])     
print(week[5:])        #맨 마지막 인덱스도 생략가능

# 전체 데이터
print(week[:])

#리스트[start:end:step]
print(week[::2])            #['월', '수', '금', '일']
print(week[1::2])           #['화', '목', '토']

week = ['일', '월', '화', '수', '목', '금', '토']
print(week[0::6])           #['일', '토']

#인덱스 번호 음수
print(week[-1])             #토 (0 = 일요일, -1 = 토요일, -2 = 금요일; 뒤에서부터 조회)
print(week[-4:-1])          #['수', '목', '금']
print(week[6::-6])          #['토', '일']